export const region = [
	{ k: '강원특별 자치도', v: 'gangwon', n: 'A' },
	{ k: '경기도', v: 'gyeonggi', n: 'B' },
	{ k: '경상남도', v: 'gyeongnam', n: 'C' },
	{ k: '경상북도', v: 'gyeongbuk', n: 'D' },
	{ k: '광주광역시', v: 'gwangju', n: 'E' },
	{ k: '대전광역시', v: 'daegu', n: 'F' },
	{ k: '대구광역시', v: 'daejeon', n: 'G' },
	{ k: '부산광역시', v: 'busan', n: 'H' },
	{ k: '서울특별시', v: 'seoul', n: 'I' },
	{ k: '세종특별자치시', v: 'sejong', n: 'J' },
	{ k: '울산광역시', v: 'ulsan', n: 'K' },
	{ k: '인천광역시', v: 'incheon', n: 'L' },
	{ k: '전라남도', v: 'jeonam', n: 'M' },
	{ k: '전라북도', v: 'jeobuk', n: 'N' },
	{ k: '제주특별자치도', v: 'jeju', n: 'O' },
	{ k: '충청남도', v: 'chungnam', n: 'P' },
	{ k: '충청북도', v: 'chungbuk', n: 'Q' }
];

export const post_seoul = [
	{ k: '강남구', v: '01' },
	{ k: '강동구', v: '02' },
	{ k: '강북구', v: '03' },
	{ k: '강서구', v: '04' },
	{ k: '관악구', v: '05' },
	{ k: '광진구', v: '06' },
	{ k: '구로구', v: '07' },
	{ k: '금천구', v: '08' },
	{ k: '노원구', v: '09' },
	{ k: '도봉구', v: '10' },
	{ k: '동대문구', v: '11' },
	{ k: '동작구', v: '12' },
	{ k: '마포구', v: '13' },
	{ k: '서대문구', v: '14' },
	{ k: '서초구', v: '15' },
	{ k: '성동구', v: '16' },
	{ k: '성북구', v: '17' },
	{ k: '송파구', v: '18' },
	{ k: '양천구', v: '19' },
	{ k: '영등포구', v: '20' },
	{ k: '용산구', v: '21' },
	{ k: '은평구', v: '22' },
	{ k: '종로구', v: '23' },
	{ k: '중구', v: '24' },
	{ k: '중랑구', v: '25' }
];

export const post_busan = [
	{ k: '강서구', v: '01' },
	{ k: '금정구', v: '02' },
	{ k: '기장군', v: '03' },
	{ k: '남구', v: '04' },
	{ k: '동구', v: '05' },
	{ k: '동래구', v: '06' },
	{ k: '부산진구', v: '07' },
	{ k: '북구', v: '08' },
	{ k: '사상구', v: '09' },
	{ k: '사하구', v: '10' },
	{ k: '서구', v: '11' },
	{ k: '수영구', v: '12' },
	{ k: '연제구', v: '13' },
	{ k: '영도구', v: '14' },
	{ k: '중구', v: '15' },
	{ k: '해운대구', v: '16' }
];

export const post_gangwon = [
	{ k: '강릉시', v: '01' },
	{ k: '고성군', v: '02' },
	{ k: '동해시', v: '03' },
	{ k: '삼척시', v: '04' },
	{ k: '속초시', v: '05' },
	{ k: '양구군', v: '06' },
	{ k: '양양군', v: '07' },
	{ k: '영월군', v: '08' },
	{ k: '원주시', v: '09' },
	{ k: '인제군', v: '10' },
	{ k: '정선군', v: '11' },
	{ k: '철원군', v: '12' },
	{ k: '춘천시', v: '13' },
	{ k: '태백시', v: '14' },
	{ k: '평창군', v: '15' },
	{ k: '홍천군', v: '16' },
	{ k: '화천군', v: '17' },
	{ k: '횡성군', v: '18' }
];
export const post_gyeonggi = [
	{ k: '가평군', v: '01' },
	{ k: '고양시 덕양구', v: '02' },
	{ k: '고양시 일산동구', v: '03' },
	{ k: '고양시 일산서구', v: '04' },
	{ k: '과천시', v: '05' },
	{ k: '광명시', v: '06' },
	{ k: '광주시', v: '07' },
	{ k: '구리시', v: '08' },
	{ k: '군포시', v: '09' },
	{ k: '김포시', v: '10' },
	{ k: '남양주시', v: '11' },
	{ k: '동두천시', v: '12' },
	{ k: '부천시', v: '13' },
	{ k: '성남시 분당구', v: '14' },
	{ k: '성남시 수정구', v: '15' },
	{ k: '성남시 중원구', v: '16' },
	{ k: '수원시 권선구', v: '17' },
	{ k: '수원시 영통구', v: '18' },
	{ k: '수원시 장안구', v: '19' },
	{ k: '수원시 팔달구', v: '20' },
	{ k: '시흥시', v: '21' },
	{ k: '안산시 단원구', v: '22' },
	{ k: '안산시 상록구', v: '23' },
	{ k: '안성시', v: '24' },
	{ k: '안양시 동안구', v: '25' },
	{ k: '안양시 만안구', v: '26' },
	{ k: '양주시', v: '27' },
	{ k: '양평군', v: '28' },
	{ k: '여주시', v: '29' },
	{ k: '연천군', v: '30' },
	{ k: '오산시', v: '31' },
	{ k: '용인시 기흥구', v: '32' },
	{ k: '용인시 수지구', v: '33' },
	{ k: '용인시 처인구', v: '34' },
	{ k: '의왕시', v: '35' },
	{ k: '의정부시', v: '36' },
	{ k: '이천시', v: '37' },
	{ k: '파주시', v: '38' },
	{ k: '평택시', v: '39' },
	{ k: '포천시', v: '40' },
	{ k: '하남시', v: '41' },
	{ k: '화성시', v: '42' }
];
export const gyeongnam = [
	{ k: '거제시', v: '01' },
	{ k: '거창군', v: '02' },
	{ k: '고성군', v: '03' },
	{ k: '김해시', v: '04' },
	{ k: '남해군', v: '05' },
	{ k: '밀양시', v: '06' },
	{ k: '사천시', v: '07' },
	{ k: '산청군', v: '08' },
	{ k: '양산시', v: '09' },
	{ k: '의령군', v: '10' },
	{ k: '진주시', v: '11' },
	{ k: '창녕군', v: '12' },
	{ k: '창원시 마산합포구', v: '13' },
	{ k: '창원시 마산회원구', v: '14' },
	{ k: '창원시 성산구', v: '15' },
	{ k: '창원시 의창구', v: '16' },
	{ k: '창원시 진해구', v: '17' },
	{ k: '통영시', v: '18' },
	{ k: '하동군', v: '19' },
	{ k: '함안군', v: '20' },
	{ k: '함양군', v: '21' },
	{ k: '합천군', v: '22' }
];
export const gyeongbuk = [
	{ k: '경산시', v: '01' },
	{ k: '경주시', v: '02' },
	{ k: '고령군', v: '03' },
	{ k: '구미시', v: '04' },
	{ k: '김천시', v: '05' },
	{ k: '문경시', v: '06' },
	{ k: '봉화군', v: '07' },
	{ k: '상주시', v: '08' },
	{ k: '성주군', v: '09' },
	{ k: '안동시', v: '10' },
	{ k: '영덕군', v: '11' },
	{ k: '영양군', v: '12' },
	{ k: '영주시', v: '13' },
	{ k: '영천시', v: '14' },
	{ k: '예천군', v: '15' },
	{ k: '울릉군', v: '16' },
	{ k: '울진군', v: '17' },
	{ k: '의성군', v: '18' },
	{ k: '청도군', v: '19' },
	{ k: '청송군', v: '20' },
	{ k: '칠곡군', v: '21' },
	{ k: '포항시 북구', v: '22' },
	{ k: '포항시 남구', v: '23' }
];

export const gwangju = [
	{ k: '광산구', v: '01' },
	{ k: '남구', v: '02' },
	{ k: '동구', v: '03' },
	{ k: '북구', v: '04' },
	{ k: '서구', v: '05' }
];

export const daegu = [
	{ k: '군위군', v: '01' },
	{ k: '남구', v: '02' },
	{ k: '달서구', v: '03' },
	{ k: '달성군', v: '04' },
	{ k: '동구', v: '05' },
	{ k: '북구', v: '06' },
	{ k: '서구', v: '07' },
	{ k: '수성구', v: '08' },
	{ k: '중구', v: '09' }
];

export const daejeon = [
	{ k: '대덕구', v: '01' },
	{ k: '동구', v: '02' },
	{ k: '서구', v: '03' },
	{ k: '유성구', v: '04' },
	{ k: '중구', v: '05' }
];
export const sejong = [
	// 세종 10
];

export const ulsan = [
	{ k: '남구', v: '01' },
	{ k: '동구', v: '02' },
	{ k: '북구', v: '03' },
	{ k: '울주군', v: '04' },
	{ k: '중구', v: '05' }
];

export const incheon = [
	{ k: '강화군', v: '01' },
	{ k: '계양구', v: '02' },
	{ k: '남동구', v: '03' },
	{ k: '동구', v: '04' },
	{ k: '미추홀구', v: '05' },
	{ k: '부평구', v: '06' },
	{ k: '서구', v: '07' },
	{ k: '연수구', v: '08' },
	{ k: '옹진군', v: '09' },
	{ k: '중구', v: '10' }
];

export const jeonam = [
	{ k: '강진군', v: '01' },
	{ k: '고흥군', v: '02' },
	{ k: '곡성군', v: '03' },
	{ k: '광양시', v: '04' },
	{ k: '구례군', v: '05' },
	{ k: '나주시', v: '06' },
	{ k: '담양군', v: '07' },
	{ k: '목포시', v: '08' },
	{ k: '무안군', v: '09' },
	{ k: '보성군', v: '10' },
	{ k: '순천시', v: '11' },
	{ k: '신안군', v: '12' },
	{ k: '여수시', v: '13' },
	{ k: '영광군', v: '14' },
	{ k: '영암군', v: '15' },
	{ k: '완도군', v: '16' },
	{ k: '장성군', v: '17' },
	{ k: '장흥군', v: '18' },
	{ k: '진도군', v: '19' },
	{ k: '함평군', v: '20' },
	{ k: '해남군', v: '21' },
	{ k: '화순군', v: '22' }
];

export const jeobuk = [
	{ k: '고창군', v: '01' },
	{ k: '군산시', v: '02' },
	{ k: '김제시', v: '03' },
	{ k: '남원시', v: '04' },
	{ k: '무주군', v: '05' },
	{ k: '부안군', v: '06' },
	{ k: '순창군', v: '07' },
	{ k: '완주군', v: '08' },
	{ k: '익산시', v: '08' },
	{ k: '임실군', v: '10' },
	{ k: '장수군', v: '11' },
	{ k: '전주시 덕진구', v: '12' },
	{ k: '전주시 완산구', v: '13' },
	{ k: '정읍시', v: '14' },
	{ k: '진안군', v: '15' }
];

export const jeju = [
	{ k: '제주시', v: '01' },
	{ k: '서귀포시', v: '02' }
];

export const chungnam = [
	{ k: '계룡시', v: '01' },
	{ k: '공주시', v: '02' },
	{ k: '금산군', v: '03' },
	{ k: '논산시', v: '04' },
	{ k: '당진시', v: '05' },
	{ k: '보령시', v: '06' },
	{ k: '부여군', v: '07' },
	{ k: '서산시', v: '08' },
	{ k: '서천군', v: '09' },
	{ k: '아산시', v: '10' },
	{ k: '예산군', v: '11' },
	{ k: '천안시 동남구', v: '12' },
	{ k: '천안시 서북구', v: '13' },
	{ k: '청양군', v: '14' },
	{ k: '태안군', v: '15' },
	{ k: '홍성군', v: '16' }
];

export const chungbuk = [
	{ k: '괴산군', v: '01' },
	{ k: '단양군', v: '02' },
	{ k: '보은군', v: '03' },
	{ k: '영동군', v: '04' },
	{ k: '옥천군', v: '05' },
	{ k: '음성군', v: '06' },
	{ k: '제천시', v: '07' },
	{ k: '증평군', v: '08' },
	{ k: '진천군', v: '09' },
	{ k: '청주시 상당구', v: '10' },
	{ k: '청주시 서원구', v: '11' },
	{ k: '청주시 흥덕구', v: '12' },
	{ k: '청주시 청원구', v: '13' },
	{ k: '충주시', v: '14' }
];
